import UIKit

//1. შექმენით სამი Int ტიპის ცვლადი, მიანიჭეთ მათ მნიშვნელობა და დაბეჭდეთ მათი ნამრავლი.

var number1: Int8 = 2
var number2: Int8 = 4
var number3: Int8 = 6
print(number1 * number2 * number3)

//2. შექმენით int ტიპის ცვლადი, მიანიჭეთ მას მნიშვნელობა და შეამოწმეთ ეს რიცხვი ლუწია თუ კენტი ტერნარი ოპერატორით.

var evenOrOdd: Int8 = 9
let resultNumber = evenOrOdd % 2 == 0 ? "ლუწი" : "კენტი"
print(resultNumber)

// შექმენით optional String-ის ტიპის და მიანიჭეთ თქვენი სახელის მნიშვნელობა. If let-ის მეშვეობით გაუკეთეთ unwrap და მნიშვნელობა დაპრინტეთ

var myName: String? = "სანდრო"
//myName = nil
if let myName { print(myName)
} else { print("უცხო მოყმე")}

//4. შექმენით ცვლადი სახელად isRaining ბულეანის ტიპის და მიანიჭეთ თქვენთვის სასურველი მნიშვნელობა. If-else-ის მეშვეობით შეამოწმეთ თუ მნიშვნელობა მიიღებს true მნიშვნელობას დაბეჭდეთ “ქოლგის წაღება არ დამავიწყდეს”, სხვა შემთხვევაში “დღეს ქოლგა არ დამჭირდება”.

var isRaining = false
if isRaining { print("ქოლგის წაღება არ დამავიწყდეს")} else { print ("დღეს ქოლგა არ დამჭირდება")}

//5. შექმენით ორი int ტიპის ცვლადი a & b და მიანიჭეთ სასურველი რიცხვები. If-else-ით შეამოწმეთ თუ a მეტია b-ზე დაბეჭდეთ “a მეტია”,  სხვა შემთხვევაში “b მეტია”

var a : Int = 7
var b : Int = 4
if a > b { print("a მეტია")} else if b > a { print("b მეტია")} else {print("ტოლია")}

//6. შექმენით მუდმივა Character ტიპის და მიანიჭეთ თქვენი სახელის პირველი ასოს მნიშვნელობა.

let sandro : Character = "ს"
print(sandro)

//7. მოცემულია ორნიშნა რიცხვი, გაიგეთ არის თუ არა ერთიდაიმავე ციფრისგან შემდგარი

var twoDigit : Int = 55
if twoDigit % 11 == 0 {print("ერთიდაიმავე ციფრისგან შემდგარი")} else {print("სხვადასხვა ციფრისგან შემდგარი")}

//8. აიღეთ ცვლადი numberOfMonths მიანიჭეთ მნიშვნელობა და იმის მიხედვით თუ მერამდენე თვეა დაბეჭდეთ ის (გაზაფხული, ზაფხული, შემოდგომა, ზამთარი) შესაბამისად

var numberOfMonths : Int = 5
if numberOfMonths >= 3 && numberOfMonths <= 5 {
    print("გაზაფხული") } else if numberOfMonths >= 6 && numberOfMonths <= 8 {
        print("ზაფხული") } else if numberOfMonths >= 9 && numberOfMonths <= 11 {
            print("შემოდგომა") } else if numberOfMonths == 12 || numberOfMonths <= 2 && numberOfMonths >= 1 {
                print("ზამთარი") }

//Optional:

//9. შექმენით მთელი რიცხვის მქონე ცვლადი. თუ ეს ცვლადი იყოფა 3-ზე, დაბეჭდეთ “იყოფა 3-ზე”, თუ ეს ცვლადი იყოფა 4-ზე დაბეჭდეთ “იყოფა 4-ზე”, თუ იყოფა ორივეზე დაბეჭდეთ “იყოფა 3-ზე და 4-ზე”

var multipleNumber : Int = 12
if multipleNumber % 3 == 0 && multipleNumber % 4 == 0 {print("იყოდა 3-ზე და 4-ზე")} else if multipleNumber % 3 == 0 {print("იყოფა 3-ზე")} else if multipleNumber % 4 == 0 {print("იყოფა 4-ზე")}

//10. შექმენით ორი რიცხვითი ცვლადი num1, num2 და რაიმე String ტიპის ცვლადი რომელსაც ტერნარული ოპერატორის საშუალებით მიანიჭებთ “თანაბრად დაშორებულია ნულიდან” / “არ არის თანაბრად დაშორებული ნულიდან” შესაბამის მნიშვნელობას რომელსაც აკმაყოფილებს მოცემული ორი ცვლადი

var num1 : Int = 8
var num2 : Int = -8
let fromZero = num1 == -num2 ? "თანაბრად დაშორებულია ნულიდან" : "არ არის თანაბრად დაშორებული ნულიდან"
print(fromZero)
// აქ გავიჭედე, თუ num1- შიც და num2- შიც ჩავწერთ ერთი და იგივე რიცვხს, მაგ 8 და 8, მაშინ დაწერს, რომ არ არის თანაბრად დაშორებული, რადგან num2 - ამინუსებს 8-ს. 0 დან მოცემულ რიცხვამდე ციფრების დათვლა ვერ გავიგე როგორ უნდა გავაკეთებინო.
